import numpy as np

#Основное поле
field = np.array([[[-1, -1], [2, 0], [-1, -1], [2, 0], [-1, -1], [2, 0], [-1, -1], [2, 0]],
                  [[2, 0], [-1, -1], [2, 0], [-1, -1], [2, 0], [-1, -1], [2, 0], [-1, -1]],
                  [[-1, -1], [2, 0], [-1, -1], [2, 0], [-1, -1], [2, 0], [-1, -1], [2, 0]],
                  [[0, 0], [-1, -1], [0, 0], [-1, -1], [0, 0], [-1, -1], [0, 0], [-1, -1]],
                  [[-1, -1], [0, 0], [-1, -1], [0, 0], [-1, -1], [0, 0], [-1, -1], [0, 0]],
                  [[1, 0], [-1, -1], [1, 0], [-1, -1], [1, 0], [-1, -1], [1, 0], [-1, -1]],
                  [[-1, -1], [1, 0], [-1, -1], [1, 0], [-1, -1], [1, 0], [-1, -1], [1, 0]],
                  [[1, 0], [-1, -1], [1, 0], [-1, -1], [1, 0], [-1, -1], [1, 0], [-1, -1]]])

'''field = np.array([[[-1, -1], [0, 0], [-1, -1], [0, 0], [-1, -1], [0, 0], [-1, -1], [0, 0]],
                  [[0, 0], [-1, -1], [0, 0], [-1, -1], [0, 0], [-1, -1], [0, 0], [-1, -1]],
                  [[-1, -1], [0, 0], [-1, -1], [0, 0], [-1, -1], [0, 0], [-1, -1], [0, 0]],
                  [[0, 0], [-1, -1], [0, 0], [-1, -1], [0, 0], [-1, -1], [0, 0], [-1, -1]],
                  [[-1, -1], [0, 0], [-1, -1], [0, 0], [-1, -1], [0, 0], [-1, -1], [0, 0]],
                  [[0, 0], [-1, -1], [0, 0], [-1, -1], [0, 0], [-1, -1], [0, 0], [-1, -1]],
                  [[-1, -1], [0, 0], [-1, -1], [0, 0], [-1, -1], [0, 0], [-1, -1], [0, 0]],
                  [[0, 0], [-1, -1], [0, 0], [-1, -1], [0, 0], [-1, -1], [0, 0], [-1, -1]]])'''

#Класс который отслеживает позицию курсора и в зависимости от нее возвращает номер клетки в матрице "field"
class Move:
    def __init__(self, event_pose):
        self.pose_x = event_pose[0]
        self.pose_y = event_pose[1]

    def move_x(self):
        if self.pose_x >= 360:
            if self.pose_x >= 540:
                if self.pose_x >= 630:
                    return 7
                else:
                    return 6
            else:
                if self.pose_x >= 450:
                    return 5
                else:
                    return 4
        else:
            if self.pose_x >= 180:
                if self.pose_x >= 270:
                    return 3
                else:
                    return 2
            else:
                if self.pose_x >= 90:
                    return 1
                else:
                    return 0


    def move_y(self):
        if self.pose_y >= 360:
            if self.pose_y >= 540:
                if self.pose_y >= 630:
                    return 7
                else:
                    return 6
            else:
                if self.pose_y >= 450:
                    return 5
                else:
                    return 4
        else:
            if self.pose_y >= 180:
                if self.pose_y >= 270:
                    return 3
                else:
                    return 2
            else:
                if self.pose_y >= 90:
                    return 1
                else:
                    return 0